Revit 2027 API
BuiltInFailures.RebarBendingDetailFailures.RemoveBendingDetailWithInvalidRebarElement Property
 The reinforcement element is no longer supporting bending details. The associated bending detail elements have been deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemoveBendingDetailWithInvalidRebarElement { get; }
Public Shared ReadOnly Property RemoveBendingDetailWithInvalidRebarElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemoveBendingDetailWithInvalidRebarElement {
	FailureDefinitionId^ get ();
}
static member RemoveBendingDetailWithInvalidRebarElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarBendingDetailFailures Class
Autodesk.Revit.DB Namespace